---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarBarStyle
source: html/de556853-cb9c-29f9-ad63-9214732d914a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarBarStyle Property

"Subcategory"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarBarStyle { get; }
```